Revit 2024 API
BuiltInFailures.CreationFailures.CannotMakeSurfaceWarn Property
 Can't construct surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMakeSurfaceWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotMakeSurfaceWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMakeSurfaceWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace